import pygame


class Field:
    # отвечает за расположение фигуры, за отображение фигуры, мячика и платформы по координатам на поле
    pass


class Ball:
    # отвечает за вид и физику мячика, его поведение на поле
    pass


class Platform:
    # отвечает за вид и физику платформы
    pass


class Block:
    # отвечает за вид фигуры, внушность кубиков и их прочность
    pass


class Gameplay:
    # отвечает за интерфейс пользователя, собирает всю игру вместе, осуществляет выход из игры
    pass


# if __name__ == '__main__':
#     main()
